# Titanic: Machine Learning from Disaster

#### Import necessary libraries

In [36]:
import pandas as pd
from sklearn.preprocessing import  LabelEncoder, OneHotEncoder

#### Get the data

In [37]:
data = pd.read_csv('gender_submission.csv')
train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')

In [38]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [39]:
train = train.drop(['PassengerId','Name', 'Ticket', 'Cabin', 'SibSp', 'Parch', 'Embarked'], axis = 1)
train.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

We believe sex to be an important variable, but it cannot be used in a calcula

In [43]:
labelEncoder = LabelEncoder()
onehotencoder = OneHotEncoder()
train_encode_sex = train.apply(labelEncoder.fit_transform)
train_encode_sex.head()

   Survived  Pclass  Sex  Age  Fare
0         0       2    1   28    18
1         1       0    0   51   207
2         1       2    0   34    41
3         1       0    0   47   189
4         0       2    1   47    43